Revit 2024 API
FabricationServiceButton.IsValid Method
 Checks if the button contains only valid fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsValid()
Visual Basic
Public Function IsValid As Boolean
Visual C++
public:
bool IsValid()
Return Value
 True if the button contains only valid fittings.
See Also
FabricationServiceButton Class
Autodesk.Revit.DB Namespace